---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.GridFailures
source: html/4568be7b-cae4-626a-9d57-7e668557d494.htm
---
# BuiltInFailures.GridFailures Properties

The end segment length for a grid must be at least [Length Value]